In [1]:
import pandas as pd

1. Importing NIKKEI 225 index data file

In [4]:
nikkei_25 = pd.read_csv("C:/Users/Admin/Documents/ironhack/ironhack-projects/Data_Thief_Project_Team_Wall-e/data/ARCHIV/01_original_index_data/NIKKEI_225_JP.csv")

In [5]:
nikkei_25.head()

         date   value
0  1949-05-16  176.21
1  1949-05-17  174.80
2  1949-05-18  172.53
3  1949-05-19  171.34
4  1949-05-20  169.20

In [6]:
nikkei_25.columns = ["date", "value_NIKKEI_25_JP"]

In [7]:
nikkei_25.head()

         date  value_NIKKEI_25_JP
0  1949-05-16              176.21
1  1949-05-17              174.80
2  1949-05-18              172.53
3  1949-05-19              171.34
4  1949-05-20              169.20

2. Changing date format

In [8]:
nikkei_25["date"] = pd.to_datetime(nikkei_25["date"])

In [9]:
nikkei_25.dtypes

date                  datetime64[ns]
value_NIKKEI_25_JP           float64
dtype: object

3. Getting data from 01-01-2019 to latest (07-04-2020)

In [10]:
nikkei_25 = (nikkei_25[nikkei_25["date"] >= "2019-01-01"]
             .reset_index()
             .drop(columns="index"))

In [11]:
#nikkei_25.drop(columns="index")

In [12]:
nikkei_25.head()

        date  value_NIKKEI_25_JP
0 2019-01-04            19561.96
1 2019-01-07            20038.97
2 2019-01-08            20204.04
3 2019-01-09            20427.06
4 2019-01-10            20163.80

In [13]:
nikkei_25.dtypes

date                  datetime64[ns]
value_NIKKEI_25_JP           float64
dtype: object

3. changing order starting from newest value

In [14]:
nikkei_25 = nikkei_25.sort_values("date", ascending=False)

In [15]:
nikkei_25 = nikkei_25.reset_index().drop(columns="index")

In [16]:
nikkei_25.head()

        date  value_NIKKEI_25_JP
0 2020-04-07            18950.18
1 2020-04-06            18576.30
2 2020-04-03            17820.19
3 2020-04-02            17818.72
4 2020-04-01            18065.41

In [17]:
#nikkei_25.to_csv("C:/Users/Admin/Documents/ironhack/ironhack-projects/Data_Thief_Project_Team_Wall-e/data/NIKKEI_225_JP_clean.csv", index=False)